<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #28 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7435292089","plan_hash":"88fa8aaefcb6d3f6bf5c881cc7984cc7ccdc2482077a15323bda8237c8be2f67","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 9 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_lb_association will be created
+   resource "aws_autoscaling_attachment" "asg_lb_association" {
+       autoscaling_group_name = (known after apply)
+       id                     = (known after apply)
+       lb_target_group_arn    = (known after apply)
    }

  # aws_autoscaling_group.ASG_config will be created
+   resource "aws_autoscaling_group" "ASG_config" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = true
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = "ELB"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 3
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = "fastapi_ASG_dev"
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (sensitive value)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       tag {
+           key                 = "AmazonECSManaged"
+           propagate_at_launch = true
+           value               = "true"
        }

+       timeouts {
+           delete = "15m"
        }
    }

  # aws_ecs_capacity_provider.test will be created
+   resource "aws_ecs_capacity_provider" "test" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "ProviderEC2Container"
+       tags_all = {
+           "Environment" = "Dev Environment"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_termination_protection = "ENABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = (known after apply)
+               minimum_scaling_step_size = (known after apply)
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # aws_ecs_cluster.fastapi-cluster will be updated in-place
!~  resource "aws_ecs_cluster" "fastapi-cluster" {
        id       = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
        name     = "fastapi-cluster"
!~      tags     = {
-           "Environment" = "Prod Environment" -> null
        }
!~      tags_all = {
!~          "Environment" = "Prod Environment" -> "Dev Environment"
        }
#        (1 unchanged attribute hidden)

+       configuration {
+           execute_command_configuration {
+               logging = "DEFAULT"
            }
        }

#        (1 unchanged block hidden)
    }

  # aws_ecs_cluster_capacity_providers.example will be created
+   resource "aws_ecs_cluster_capacity_providers" "example" {
+       capacity_providers = [
+           "ProviderEC2Container",
        ]
+       cluster_name       = "fastapi-cluster"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "ProviderEC2Container"
+           weight            = 100
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "EC2"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-091e964d65dee5150",
            ]
+           subnets          = (sensitive value)
        }
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:23" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:313f74c2b06d005bbed046653dffe1b3ba9ad2c5" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:5f152fbc2bc9c8d2d1790f0bec9fd1012f2faba4"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      requires_compatibilities = [ # forces replacement
+           "EC2",
#            (1 unchanged element hidden)
        ]
!~      revision                 = 23 -> (known after apply)
-       tags                     = {} -> null
#        (6 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.instance_profile will be created
+   resource "aws_iam_instance_profile" "instance_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "InstanceRoleForECS"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "ecsInstanceRole"
+       tags_all    = {
+           "Environment" = "Dev Environment"
        }
+       unique_id   = (known after apply)
    }

  # aws_launch_template.ASG_template will be created
+   resource "aws_launch_template" "ASG_template" {
+       arn                  = (known after apply)
+       default_version      = (known after apply)
+       id                   = (known after apply)
+       image_id             = (sensitive value)
+       instance_type        = "t2.micro"
+       latest_version       = (known after apply)
+       name                 = "LaunchTemplateECR"
+       name_prefix          = (known after apply)
+       security_group_names = [
+           "sg-091e964d65dee5150",
        ]
+       tags_all             = {
+           "Environment" = "Dev Environment"
        }

+       iam_instance_profile {
+           name = "InstanceRoleForECS"
        }
    }

  # aws_lb_listener.listerner will be updated in-place
!~  resource "aws_lb_listener" "listerner" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/ee86fac4e1b9fd4a"
        tags              = {}
#        (7 unchanged attributes hidden)

!~      default_action {
!~          target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/f89998bea563bd7d" -> (known after apply)
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/f89998bea563bd7d" -> (known after apply)
!~      arn_suffix                         = "targetgroup/alb-target-group-dev/f89998bea563bd7d" -> (known after apply)
+       connection_termination             = (known after apply)
!~      id                                 = "********************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
!~      load_balancing_algorithm_type      = "round_robin" -> (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       preserve_client_ip                 = (known after apply)
!~      protocol_version                   = "HTTP1" -> (known after apply)
-       tags                               = {} -> null
!~      target_type                        = "ip" -> "instance" # forces replacement
#        (8 unchanged attributes hidden)

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTP" -> null
-           timeout             = 5 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 86400 -> null
-           enabled         = false -> null
-           type            = "lb_cookie" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

Plan: 9 to add, 2 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #28](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7435292089)